/*
// 赢了

//主号：击晕号
void 当前对手(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=57.3941;
		self->血=524.28;
		self->剩余生命=self->血;
		self->防=9.2975;
		self->敏=4801;
		self->道法伤倍率_乘在攻=2.2;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="七十二变";
		self->主灵兽伤倍率_乘在攻=1.56;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=2;
		self->主灵兽名称="白虎";
		self->协同灵兽伤倍率_乘在攻=0.98;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="碎心法";
		self->扶桑回血=0.12;
		self->碎心法回血=0.12;
		self->增伤系数=(100 + 5.8 - 13.5) / 100;
		self->强灵系数=(100+ 10.8 - 10.8) / 100;
		self->携带精怪="骨魅,扶桑";
		self->战斗抗性之抗晕=141;
		self->战斗属性之击晕=106;
		self->朱雀灵脉层数=1;
		self->漏晕几次=0;
		self->额外伤限定回合数=0;
		self->自行设置额外伤=0;
	}
	else
	{
		self->攻=30.0527;
		self->血=299.98;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=5.2298;
		// 故意弄到后手方
		self->敏=4570;
		self->道法伤倍率_乘在攻=1.2;
		self->道法名称="三味火";
		self->主灵兽伤倍率_乘在攻=0;
		self->主灵兽回血倍率_乘在攻=1.11;
		self->主灵兽出手频率=2;
		self->主灵兽名称="鸾鸟";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="三味火,识海钉,碎心法,化羽";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 22.6) / 100;
		self->强灵系数=(100 + 4.3 - 15.4) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,大树妖,女帝";
		self->战斗属性之击晕=212+6;
		self->战斗抗性之抗晕=113+8;
		self->朱雀灵脉层数=4;
		// 设置大于已知回合数可无晕
		// 设置漏晕0次，以及「除了设置漏晕以外的皆必晕」为true，可必晕
		self->漏晕几次=0;
		self->除了设置漏晕以外的皆必晕=true ;
		self->自行设置额外伤=30.0527/52.428*0.03;
		self->额外伤限定回合数=20;
	}
	
	双方初始信息的结尾统一部分(self);
}




*/


/*
// 赢了
//主号：击晕号
void 当前对手(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=57.3941;
		self->血=477.65;
		self->剩余生命=self->血;
		self->防=9.3011;
		self->敏=4793;
		self->道法伤倍率_乘在攻=1.2;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="五色神光";
		self->主灵兽伤倍率_乘在攻=5.5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0.98;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="五色神光,拘神,践踏,大魔邪身";
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 4.7 - 13.5) / 100;
		self->强灵系数=(100+ 11.4 - 10.8) / 100;
		self->携带精怪="皇帝,干饭人,阁主";
		self->战斗抗性之抗晕=88.4+3.2;
		self->战斗属性之击晕=91+2.3;
		self->朱雀灵脉层数=1;
		self->漏晕几次=0;
		self->额外伤限定回合数=1;
		self->自行设置额外伤=0.1;
	}
	else
	{
		self->攻=29.0896;
		self->血=293.13;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=5.1408;
		// 故意弄到后手方
		self->敏=4570;
		self->道法伤倍率_乘在攻=1.2;
		self->道法名称="三味火";
		self->主灵兽伤倍率_乘在攻=5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="三味火,识海钉,碎心法,化羽";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 8.3) / 100;
		self->强灵系数=(100 + 4.3 - 4.5) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,山泽精,大树妖";
		self->战斗属性之击晕=198;
		self->战斗抗性之抗晕=74;
		self->朱雀灵脉层数=4;
		// 设置大于已知回合数可无晕
		// 设置漏晕0次，以及「除了设置漏晕以外的皆必晕」为true，可必晕
		self->漏晕几次=0;
		self->除了设置漏晕以外的皆必晕=true ;
		self->自行设置额外伤=0;
		self->额外伤限定回合数=0;
	}
	
	双方初始信息的结尾统一部分(self);
}
*/

/*
// 赢了
// 另一个号：反暴号
void 当前对手_另一个号反暴的(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=43.0892;
		self->血=364.08;
		self->剩余生命=self->血;
		self->防=6.7815;
		self->敏=4321;
		self->道法伤倍率_乘在攻=0;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="五行补缺";
		self->主灵兽伤倍率_乘在攻=5.5;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=1.56;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="麒麟";
		self->携带神通="五行补缺,吞灵,丹心同并,火眼金睛";
		self->碎心法回血=0.12;
		self->增伤系数=(100 + 3.9 - 8.8) / 100.0;
		self->强灵系数=(100+ + 9.9 - 3.7) / 100.0;
		self->携带精怪="黑麒麟,扶桑,雷公";
		self->战斗抗性之抗晕=98;
		self->战斗属性之击晕=81.7;
		self->朱雀灵脉层数=0;
		self->漏晕几次=0;
		self->自行设置额外伤=0.12;
		self->额外伤限定回合数=2;
	}
	else
	{
		self->攻=28.4;
		self->血=276;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.7;
		// 故意弄到后手方
		self->敏=4137;
		self->道法伤倍率_乘在攻=1.6;
		self->道法名称="冰封千里";
		self->主灵兽伤倍率_乘在攻=5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0.6;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=1;
		self->协同灵兽名称="青龙";
		self->携带神通="冰封千里,识海钉,碎心法,金刚不坏";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.03;
		self->增伤系数=(100 + 9.5 - 5.9) / 100.0;
		self->强灵系数=(100 + 14.6 - 22.7) / 100.0;
		self->大树妖层数=0;
		self->携带精怪="山泽精,马面,骨魅";
		self->战斗属性之击晕=43+8.9;
		self->战斗抗性之抗晕=132+12.5;
		self->朱雀灵脉层数=0;
		// 设置大于已知回合数可无晕
		self->漏晕几次=0;
		self->自行设置额外伤=0;
		self->额外伤限定回合数=0;
	}
	
	双方初始信息的结尾统一部分(self);
}
*/

/*
// 赢了
void 当前对手_另一个号反暴的(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=44.1173;
		self->血=377.58;
		self->剩余生命=self->血;
		self->防=7.2536;
		self->敏=4889;
		self->道法伤倍率_乘在攻=0;
		self->道法回血倍率_乘在攻=1.1;
		self->道法名称="回生真言";
		self->主灵兽伤倍率_乘在攻=5.5;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=1.26;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="玄武";
		self->携带神通="碎心法";
		self->碎心法回血=0.12;
		self->增伤系数=(100 + 1.5 - 8.8) / 100;
		self->强灵系数=(100+ + 21.4 - 3.7) / 100;
		self->携带精怪="皇帝,鬼将,雷公";
		self->战斗抗性之抗晕=130;
		self->战斗属性之击晕=147;
		self->朱雀灵脉层数=0;
		self->漏晕几次=0;
		self->自行设置额外伤=0;
		self->额外伤限定回合数=0;
	}
	else
	{
		self->攻=28.4;
		self->血=276;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.7;
		// 故意弄到后手方
		self->敏=4137;
		self->道法伤倍率_乘在攻=1.6;
		self->道法名称="冰封千里";
		self->主灵兽伤倍率_乘在攻=5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0.6;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=1;
		self->协同灵兽名称="青龙";
		self->携带神通="冰封千里,识海钉,碎心法,金刚不坏";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.3;
		self->增伤系数=(100 + 9.5 - 7.1) / 100;
		self->强灵系数=(100 + 14.6 - 8.3) / 100;
		self->大树妖层数=0;
		self->携带精怪="山泽精";
		self->战斗属性之击晕=43+8.9;
		self->战斗抗性之抗晕=132+12.5;
		self->朱雀灵脉层数=0;
		// 设置大于已知回合数可无晕
		self->漏晕几次=0;
		self->自行设置额外伤=0;
		self->额外伤限定回合数=0;
	}
	
	双方初始信息的结尾统一部分(self);
}
/*


/*
// 赢了
void 当前对手_另一个号反暴的(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=42.1827;
		self->血=374.43;
		self->剩余生命=self->血;
		self->防=6.2453;
		self->敏=4015;
		self->道法伤倍率_乘在攻=1.87;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="身外身法";
		self->主灵兽伤倍率_乘在攻=5.5;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0.72;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=1;
		self->协同灵兽名称="青龙";
		self->携带神通="身外身法,附灵术,暗袭,三头六臂";
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 5.6 - 8.8) / 100;
		self->强灵系数=(100+ + 4.5 - 4.7) / 100;
		self->携带精怪="雷公,玄冥蛟,紫晴龙狮";
		self->战斗抗性之抗晕=85;
		self->战斗属性之击晕=110;
		self->朱雀灵脉层数=1;
		self->漏晕几次=0;
		self->自行设置额外伤=0.245;
		self->额外伤限定回合数=2;
	}
	else
	{
		self->攻=28.2;
		self->血=276;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.7;
		// 故意弄到后手方
		self->敏=4137;
		self->道法伤倍率_乘在攻=1.6;
		self->道法名称="冰封千里";
		self->主灵兽伤倍率_乘在攻=5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0.6;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=1;
		self->协同灵兽名称="青龙";
		self->携带神通="冰封千里,识海钉,碎心法,金刚不坏";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 9.5 - 4.7) / 100;
		self->强灵系数=(100 + 14.6 - 11.9) / 100;
		self->大树妖层数=0;
		self->携带精怪="山泽精";
		self->战斗属性之击晕=43+8.9;
		self->战斗抗性之抗晕=132+12.5;
		self->朱雀灵脉层数=0;
		// 设置大于已知回合数可无晕
		self->漏晕几次=0;
		self->自行设置额外伤=0.07;
		self->额外伤限定回合数=2;
	}
	
	双方初始信息的结尾统一部分(self);
}
*/


/*

void 对手模板_斗法丹心中频(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=38.9586;
		self->血=413.75;
		self->剩余生命=self->血;
		self->防=7.6643;
		self->敏=4834;
		self->道法伤倍率_乘在攻=1.26;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="三味火";
		self->主灵兽伤倍率_乘在攻=1.8;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=2;
		self->主灵兽名称="无支祁";
		self->协同灵兽伤倍率_乘在攻=5;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=5;
		self->协同灵兽名称="应龙";
		self->携带神通="三味火,侵神三重,丹心同并,凰焰邪身";
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 6.7 - 13.5) / 100;
		self->强灵系数=(100+ + 6.9 - 4.4) / 100;
		self->携带精怪="小龙女,扶桑,玄冥蛟";
		self->战斗抗性之抗晕=80.5;
		self->战斗属性之击晕=95.7+6.3;
		self->朱雀灵脉层数=0;
	}
	else
	{
		self->攻=25.6;
		self->血=259;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.4;
		// 故意弄到后手方
		self->敏=4464;
		self->道法伤倍率_乘在攻=2.2;
		self->道法名称="七十二变";
		self->主灵兽伤倍率_乘在攻=0;
		self->主灵兽回血倍率_乘在攻=1.11;
		self->主灵兽出手频率=2;
		self->主灵兽名称="鸾鸟";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="七十二变,识海钉,碎心法,化羽";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 16.3) / 100;
		self->强灵系数=(100 + 4.3 - 4.4) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,大树妖";
		self->战斗属性之击晕=188;
		self->战斗抗性之抗晕=74;
		self->朱雀灵脉层数=4;
		self->漏晕几次=-21;
		self->自行设置额外伤=0.018;
	}
	
	双方初始信息的结尾统一部分(self);
}



*/


/*
void 对手模板_斗法(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=34.1;
		self->血=359;
		self->剩余生命=self->血;
		self->防=6.1;
		self->敏=4223;
		self->道法伤倍率_乘在攻=0;
		self->道法回血倍率_乘在攻=1.3;
		self->道法名称="护体金光";
		self->主灵兽伤倍率_乘在攻=0.84;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=1;
		self->主灵兽名称="青龙";
		self->协同灵兽伤倍率_乘在攻=5.5;
		self->协同灵兽回血倍率_乘在攻=0;
		self->协同灵兽出手频率=5;
		self->协同灵兽名称="应龙";
		self->携带神通="护体金光,返本归元,舔舐,飘渺身";
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 3.5 - 13.5) / 100;
		self->强灵系数=(100+ + 5.4 - 4.4) / 100;
		self->携带精怪="紫晴龙狮,鬼将,水官大帝";
		self->战斗抗性之抗晕=91.6;
		self->战斗属性之击晕=127.5;
		self->朱雀灵脉层数=0;
		self->漏晕几次=1;
	}
	else
	{
		self->攻=25.6;
		self->血=259;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.4;
		// 故意弄到后手方
		self->敏=4464;
		self->道法伤倍率_乘在攻=2.2;
		self->道法名称="七十二变";
		self->主灵兽伤倍率_乘在攻=0.96;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=1;
		self->主灵兽名称="青龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽出手频率=2;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="七十二变,识海钉,碎心法,化羽";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 10.4) / 100;
		self->强灵系数=(100 + 4.3 - 11.5) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,大树妖,山泽精";
		self->战斗属性之击晕=188;
		self->战斗抗性之抗晕=74;
		self->朱雀灵脉层数=4;
		// 设置大于已知回合数可无晕
		self->漏晕几次=2;
	}
	
	双方初始信息的结尾统一部分(self);
}

/*


/*

// 不要改动
void 对手模板_星宿(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=28.5;
		self->血=286;
		self->剩余生命=self->血;
		self->防=4.7;
		self->敏=10837;
		self->道法伤倍率_乘在攻=1.6;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="冰封千里";
		self->主灵兽伤倍率_乘在攻=4.5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=1.42;
		self->协同灵兽名称="玄武";
		self->携带神通="冰封千里,饮魂法,碎心法,天媚体";
		self->碎心法回血=0.12;
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 16.8 - 13.5) / 100;
		self->强灵系数=(100+ + 26 - 4.4) / 100;
		self->携带精怪="了道真,破阵书生,水官";
		self->战斗抗性之抗晕=147;
		self->战斗属性之击晕=35;
		self->朱雀灵脉层数=0;
	}
	else
	{
		self->攻=25.4;
		self->血=257;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.4;
		self->敏=4427;
		self->道法伤倍率_乘在攻=2.2;
		self->道法名称="七十二变";
		self->主灵兽伤倍率_乘在攻=5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="七十二变,识海钉,碎心法,铜皮铁骨";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 19.8) / 100;
		self->强灵系数=(100 + 4.3 - 57.1) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,大树妖,山泽精";
		self->战斗属性之击晕=183;
		self->战斗抗性之抗晕=73;
		self->朱雀灵脉层数=4;
	}
	
	双方初始信息的结尾统一部分(self);
}




// 不要改动
void 对手模板_妖盟悬赏(Fight_info *self, char *who)
{
	双方初始信息的开头统一部分以及先行初始化(self);

	if (!strcmp(who, "敌"))
	{
		self->攻=49.1;
		self->血=463;
		self->剩余生命=self->血;
		self->防=7.91;
		self->敏=4232;
		self->道法伤倍率_乘在攻=1.2;
		self->道法回血倍率_乘在攻=0;
		self->道法名称="三味火";
		self->主灵兽伤倍率_乘在攻=5.5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=1.42;
		self->协同灵兽名称="玄武";
		self->携带神通="三味火,侵神三重,灵脉唤醒,金刚不坏";
		self->扶桑回血=0.12;
		self->增伤系数=(100 + 3.5 - 13.5) / 100;
		self->强灵系数=(100+ + 8.5 - 4.4) / 100;
		self->携带精怪="扶桑,大树妖,山魈";
		self->战斗抗性之抗晕=120;
		self->战斗属性之击晕=97;
		self->朱雀灵脉层数=0;
	}
	else
	{
		self->攻=26;
		self->血=264;
		self->已损生命=0;
		self->剩余生命=self->血;
		self->防=4.5;
		self->敏=4427;
		self->道法伤倍率_乘在攻=2.2;
		self->道法名称="七十二变";
		self->主灵兽伤倍率_乘在攻=4.5;
		self->主灵兽回血倍率_乘在攻=0;
		self->主灵兽出手频率=5;
		self->主灵兽名称="应龙";
		self->协同灵兽伤倍率_乘在攻=0;
		self->协同灵兽回血倍率_乘在攻=0.85;
		self->协同灵兽名称="鸾鸟";
		self->携带神通="七十二变,识海钉,碎心法,铜皮铁骨";
		self->碎心法回血=0.12;
		self->识海钉掉血伤=0.028;
		self->增伤系数=(100 + 6.8 - 13.4) / 100;
		self->强灵系数=(100 + 4.3 - 1.4) / 100;
		self->大树妖层数=0;
		self->携带精怪="小龙女,大树妖";
		self->战斗属性之击晕=183;
		self->战斗抗性之抗晕=73;
		self->朱雀灵脉层数=4;
	}
	
	双方初始信息的结尾统一部分(self);
}


*/